ag1357/TactilityApps/Apps/CascadeTerrace/sdkconfig.defaults
# FreeRTOS defaults (must match wit OS)
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TASK_NOTIFICATION_ARRAY_ENTRIES=2
CONFIG_FREERTOS_SMP=n
CONFIG_FREERTOS_UNICORE=n
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096
CONFIG_FREERTOS_USE_TRACE_FACILITY=y

# FatFS defaults (must match with OS)
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_VOLUME_COUNT=3

# App-specific
CONFIG_PARTITION_TABLE_SINGLE_APP=y
CONFIG_ESP_SYSTEM_MEMPROT_FEATURE_LOCK=n

# Platform
CONFIG_IDF_TARGET="esp32p4"

# Force newlib for IDF 6.x and higher
CONFIG_LIBC_NEWLIB=y
